#### [`repos`] Terraform Plan 📖`success`

<a href="https://app.terraform.io/app/cdktf-team/prebuilt-providers/runs/run-916eRgneChQM2VmG" target="_blank">Remote Plan Link ↗️</a>

<details><summary>Show Plan</summary>

```tf
[command]/home/runner/work/_temp/6a1cea78-cbb2-4842-b6b3-6529f19fb04b/terraform-bin plan -no-color
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/cdktf-team/prebuilt-providers/runs/run-916eRgneChQM2VmG

Waiting for the plan to start...

Terraform v1.0.7
on linux_amd64
Initializing plugins and modules...

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # github_team_repository.repos_cdktfproviderrandomgo_repositorysetup_managingteam_FC63033C has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderrandomgo_repositorysetup_managingteam_FC63033C" {
      ~ etag       = "W/\"9ce7e8851bfb99fa54c450fa382b816d2aee01e83329fc38fa783af2a1a604e6\"" -> "W/\"186d7b91f499312d5c61c07bb05482256ec076da1ad1432e67e94eae8b0f4551\""
        id         = "6602018:cdktf-provider-random-go"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderazurerm_repositorysetup_managingteam_345DF047 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderazurerm_repositorysetup_managingteam_345DF047" {
      ~ etag       = "W/\"64734bb71503f9e9a2d3bc1b489eb598c8875793e98a6da4190a2466f8d98913\"" -> "W/\"5c4e6d030fd6dde563f6534d0981f6af027d2979ddef9e8360ae274b31686eb6\""
        id         = "6602018:cdktf-provider-azurerm"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderkubernetes_repositorysetup_managingteam_35C88BB2 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderkubernetes_repositorysetup_managingteam_35C88BB2" {
      ~ etag       = "W/\"a90a6866ee41e3e9f9679a5aaddd5d67eb78e34f130e15dfeba3084e57e263af\"" -> "W/\"63ce631047e699cb760bff14178b2f425fe6ea79a40243c293707a8f36cae595\""
        id         = "6602018:cdktf-provider-kubernetes"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfproviderexternal_repo_2177D259 has been changed
  ~ resource "github_repository" "repos_cdktfproviderexternal_repo_2177D259" {
      ~ etag                   = "W/\"fa49aedd54311e680cbc006ebaddc40b16bcb99b79130a86df3923e1fc2ab584\"" -> "W/\"a1428a76a9cc42bb72c21b58d1353c2f1e22963b475b1c74ceee2e86064b014e\""
        id                     = "cdktf-provider-external"
        name                   = "cdktf-provider-external"
        # (26 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfproviderawsgo_repo_AE367E97 has been changed
  ~ resource "github_repository" "repos_cdktfproviderawsgo_repo_AE367E97" {
      ~ etag                   = "W/\"4ed7363d192ab54fec79458ff199b19a0dface41c7e598fff961810913dc6cb6\"" -> "W/\"4fbd0f0dffec7272d9619c611cfd66519e0faa24b1811123760c81b35c5a5eed\""
        id                     = "cdktf-provider-aws-go"
        name                   = "cdktf-provider-aws-go"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderhelm_repositorysetup_managingteam_A4243DAE has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderhelm_repositorysetup_managingteam_A4243DAE" {
      ~ etag       = "W/\"f762a5b9f7cb5ca2f8704fac34ec5d65bde8ae2919992eb2ad361eea245e18c3\"" -> "W/\"ce5fa04de6d8363d8d91658ecd92ca88415a36ff0ae43a7d83214eed657249d7\""
        id         = "6602018:cdktf-provider-helm"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderexternal_repositorysetup_managingteam_247C14FA has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderexternal_repositorysetup_managingteam_247C14FA" {
      ~ etag       = "W/\"fdb9fb758193e894467c41cbe8b5d8cd267c23367591ef2f18d6e754c1ce92e4\"" -> "W/\"8f5e2b0aeee29ac9d69041ef14d6cba62052b5863b9092271577aae507ea6677\""
        id         = "6602018:cdktf-provider-external"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderazurermgo_repositorysetup_managingteam_FE619067 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderazurermgo_repositorysetup_managingteam_FE619067" {
      ~ etag       = "W/\"afa7f1e43995ffe6866efbbe9f3098fc17f15a0cbce80728b8377ee8b0a8c7bf\"" -> "W/\"1f7dea666f13903c29906f65df43a38602954ec415887582fadf29190c1bdf92\""
        id         = "6602018:cdktf-provider-azurerm-go"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderpostgresql_repositorysetup_managingteam_1A74D5A1 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderpostgresql_repositorysetup_managingteam_1A74D5A1" {
      ~ etag       = "W/\"1f50e0a08857d954aef929d67f2c88f4aabad1c9eace26178fd4f1192bf9a217\"" -> "W/\"bc3a357ece0e56f01534becf49d510247ad378b8331bbe64f066f4ba091c13fe\""
        id         = "6602018:cdktf-provider-postgresql"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfprovidergithub_repo_66B8E54A has been changed
  ~ resource "github_repository" "repos_cdktfprovidergithub_repo_66B8E54A" {
      ~ etag                   = "W/\"e947842639ff8e8ad0f9449e37ea785853cbf12ed22e63b2eeb9c7c7531d0ccb\"" -> "W/\"6974630c4aa4225395b4faf989055bebc9f2eb91b4d832281a9d338e5951a507\""
        id                     = "cdktf-provider-github"
        name                   = "cdktf-provider-github"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovideroktago_repositorysetup_managingteam_2FF4D160 has been changed
  ~ resource "github_team_repository" "repos_cdktfprovideroktago_repositorysetup_managingteam_2FF4D160" {
      ~ etag       = "W/\"682cb1a8ebb14f471b9300660b47e144783438c2289bb593ea1c5a64edd99399\"" -> "W/\"b6130134933118c1eee41b395cfd8db499cd1192fef2b88299ddc4367de8f42d\""
        id         = "6602018:cdktf-provider-okta-go"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderupcloud_repositorysetup_managingteam_D47CCEF5 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderupcloud_repositorysetup_managingteam_D47CCEF5" {
      ~ etag       = "W/\"27d86ebcf9c99a4173be32f6597a525ddd5c0745858117181f0d74c10a7036d6\"" -> "W/\"2b05f6bd6a2240029e762c38013cc793101506627502712a03f371fc5eb656f8\""
        id         = "6602018:cdktf-provider-upcloud"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfproviderdatabricks_repo_43A853E0 has been changed
  ~ resource "github_repository" "repos_cdktfproviderdatabricks_repo_43A853E0" {
      ~ etag                   = "W/\"4dfd5654baae4dae6b276fb9b53ad54293f9182fbf46d3c63f51e804f386f978\"" -> "W/\"13e79ab8877056237be29b05eac4b013049df5c9f4022c0db292264f4bdcc5a1\""
        id                     = "cdktf-provider-databricks"
        name                   = "cdktf-provider-databricks"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidergithub_repositorysetup_managingteam_09F895B2 has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidergithub_repositorysetup_managingteam_09F895B2" {
      ~ etag       = "W/\"9309f8162de199742a10b167d17802c28e4338cbb1376eac47d356d71e441aaa\"" -> "W/\"4cdc7025435193b2366ad592df5bd6d01ebae376742be9afb3c1ac270e8d961e\""
        id         = "6602018:cdktf-provider-github"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidersnowflakego_repositorysetup_managingteam_EB46CF4B has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidersnowflakego_repositorysetup_managingteam_EB46CF4B" {
      ~ etag       = "W/\"f29ec3aee65560fcd41ed2ae14f15876163055bb0c2c4324db60eac36e95f77e\"" -> "W/\"297cfd0f93476cd92ac59350ee8a5f8a510cf023fae3c219a7319789e4e56ba7\""
        id         = "6602018:cdktf-provider-snowflake-go"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovideracmego_repositorysetup_managingteam_957FC68C has been changed
  ~ resource "github_team_repository" "repos_cdktfprovideracmego_repositorysetup_managingteam_957FC68C" {
      ~ etag       = "W/\"01496f6c05aa5bfcd1cc70938a21919844ce26644c98fc922b21acc36068d479\"" -> "W/\"0a5d8dd4e875ffbc462de096dbcd5d63c54c711e3ede427d1e9bf705d2fe5635\""
        id         = "6602018:cdktf-provider-acme-go"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderawsgo_repositorysetup_managingteam_8F56FD3E has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderawsgo_repositorysetup_managingteam_8F56FD3E" {
      ~ etag       = "W/\"6ad23ee78cab30a6e4f5ace6bcc06c4b946260dd0df294ee3accbce89f737ae7\"" -> "W/\"37c9bdd7becd190c8dad32bc58224be2fcb595ec0e1893b8c856f89cedfc7eae\""
        id         = "6602018:cdktf-provider-aws-go"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfprovidertls_repo_E6EAEEBE has been changed
  ~ resource "github_repository" "repos_cdktfprovidertls_repo_E6EAEEBE" {
      ~ etag                   = "W/\"cc6f5dd68059ab579b8d01d82b846c34ab26c0a4bf3932d5dd94cf12395f8920\"" -> "W/\"1636786191655efab1bb55c78c5fa68231536799abc40ccc7eb068554dd25a2f\""
        id                     = "cdktf-provider-tls"
        name                   = "cdktf-provider-tls"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidervault_repositorysetup_managingteam_5D99059E has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidervault_repositorysetup_managingteam_5D99059E" {
      ~ etag       = "W/\"1a58c84c1585ce2d8b645695eb574667925f237886645416c919938aca6f45b7\"" -> "W/\"7805df07e74a8e124712e1c964720203f861f20592b2223cf2f38a8f66b56a8f\""
        id         = "6602018:cdktf-provider-vault"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderionoscloud_repositorysetup_managingteam_7B7276FB has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderionoscloud_repositorysetup_managingteam_7B7276FB" {
      ~ etag       = "W/\"89cdcda6b34ebbb8e92337ddd0c0c23fc18bb7527e7e94455eb37502e1c62880\"" -> "W/\"f86ae9ca72e6f5879ca99fa68c900869ac5ae325d0e33964406e6142bbdef570\""
        id         = "6602018:cdktf-provider-ionoscloud"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderhashicupsgo_repositorysetup_managingteam_426D5626 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderhashicupsgo_repositorysetup_managingteam_426D5626" {
      ~ etag       = "W/\"aeff715907a8233b8e53218dde070f6fe4cfdaa2f4f963bc5c2d83e1489e50f1\"" -> "W/\"c97959e9212b3e081a84eeae1883b42ebeb91e128a71d2e3e59f38f089dac474\""
        id         = "6602018:cdktf-provider-hashicups-go"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfproviderproject_repo_014C3CE2 has been changed
  ~ resource "github_repository" "repos_cdktfproviderproject_repo_014C3CE2" {
      ~ etag                   = "W/\"5541836aebc09bed27e46c5867b3233c1cd240d4a4f18eb3aaaea0685c2c78ae\"" -> "W/\"dcfba6d78ac6cfa7e5b5eb502b5fdecb6d7c743e198f319271d32619504cb0bb\""
        id                     = "cdktf-provider-project"
        name                   = "cdktf-provider-project"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderokta_repositorysetup_managingteam_0EC4F3DA has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderokta_repositorysetup_managingteam_0EC4F3DA" {
      ~ etag       = "W/\"1971ab5c534d9d024f472837e9bacbb9106003aac2dd4b658e651bc462ce56c6\"" -> "W/\"58f4f56773bd6812452303c4821ed28b212d9971c0f6f74f14d5f60f208c20d5\""
        id         = "6602018:cdktf-provider-okta"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfprovidergitlab_repo_2ECAC2E4 has been changed
  ~ resource "github_repository" "repos_cdktfprovidergitlab_repo_2ECAC2E4" {
      ~ etag                   = "W/\"369da6c89723276af0b408f2669d29b5305e1638fdffef981f1b2b9e39742968\"" -> "W/\"7962f85e66a85dc2b5d0cd60675207eb7254cdf562fc8a144ce08f6c52cd454a\""
        id                     = "cdktf-provider-gitlab"
        name                   = "cdktf-provider-gitlab"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidertfego_repositorysetup_managingteam_19BE5A50 has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidertfego_repositorysetup_managingteam_19BE5A50" {
      ~ etag       = "W/\"3c0420620f065cba093b10676af1cc1f4e9b1986bc0a9aea23a57dea0cc7d14d\"" -> "W/\"5ec7a85d276f70cf3c61dea8d32d6595136e6a9bc5cc621a3e5add02932b69fb\""
        id         = "6602018:cdktf-provider-tfe-go"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderpagerdutygo_repositorysetup_managingteam_63CBEFA1 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderpagerdutygo_repositorysetup_managingteam_63CBEFA1" {
      ~ etag       = "W/\"5568f171602b0ffafacfb0bbb35453698f2a0112490b153df16af33a0af4ea22\"" -> "W/\"57a40554c3fd33986c5099805f8bbce37c9d9a63a0ce8d311a09c8887251614e\""
        id         = "6602018:cdktf-provider-pagerduty-go"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderdnsimple_repositorysetup_managingteam_30FA9B9E has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderdnsimple_repositorysetup_managingteam_30FA9B9E" {
      ~ etag       = "W/\"332773d31239c18adfdb5245b2a4bf0a1867735431c8126f252909db5268ba0d\"" -> "W/\"ef6a016d115f1e123faef51381e353a4e26f5b4d1112e65ef8d8f0d0793fa448\""
        id         = "6602018:cdktf-provider-dnsimple"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidertemplate_repositorysetup_managingteam_4C76673E has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidertemplate_repositorysetup_managingteam_4C76673E" {
      ~ etag       = "W/\"42e37981d961f1ffd310ba8313f6ced29b3a31927551e7a66d5449e58740f6bb\"" -> "W/\"0302c4f9e16bbdbf5eaa21f7c2e5780f62a0b90083fcfdc211ee5224e2c2e8fe\""
        id         = "6602018:cdktf-provider-template"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidertls_repositorysetup_managingteam_77FE4EF4 has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidertls_repositorysetup_managingteam_77FE4EF4" {
      ~ etag       = "W/\"b8aed120122fee8190e543647a2c7e8ff73ae155a4304e7134345a5199ceddf9\"" -> "W/\"65d771a3995e1124d867c87b66156fc37114dac212e633eaf4780b97a678b00f\""
        id         = "6602018:cdktf-provider-tls"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidernewrelicgo_repositorysetup_managingteam_18EA944B has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidernewrelicgo_repositorysetup_managingteam_18EA944B" {
      ~ etag       = "W/\"1fcd3f6da4919bf6b256864712ad2bc148f8f53f897fedfed25a6ff4d6350b80\"" -> "W/\"612e561828792af9214237270333afcbe061876315bcd30c802f3796a91ab603\""
        id         = "6602018:cdktf-provider-newrelic-go"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidergoogle_repositorysetup_managingteam_4B78DB32 has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidergoogle_repositorysetup_managingteam_4B78DB32" {
      ~ etag       = "W/\"79a84dd715d688ce449522bf167e143eb3eda73b774167980fd5caaaf08cd52c\"" -> "W/\"f6aca0cac1be9612328c67eb5be7dcf59fbb616db3a201a8b6118ca79f46d15a\""
        id         = "6602018:cdktf-provider-google"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderspotinst_repositorysetup_managingteam_4EDAB9E0 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderspotinst_repositorysetup_managingteam_4EDAB9E0" {
      ~ etag       = "W/\"eab224582feca85d6acaf5c112eb564a965f2b45e83e895ad5069e8611aa7f9c\"" -> "W/\"dccb56d57b449a6720c49292519d0ca29f548c86c5c06b2cdff26db4cebc4d9a\""
        id         = "6602018:cdktf-provider-spotinst"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfprovidergoogle_repo_3D7769E0 has been changed
  ~ resource "github_repository" "repos_cdktfprovidergoogle_repo_3D7769E0" {
      ~ etag                   = "W/\"6ba0726f69109b7879d93f6f9e98f18cf4acf94920d2263acd0f699935b5a9f6\"" -> "W/\"2aabbce62f98ddd70c3cd571b73e41d9f8d2ed7763f295b1fab3d7e873a9a67e\""
        id                     = "cdktf-provider-google"
        name                   = "cdktf-provider-google"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderrandom_repositorysetup_managingteam_892197FD has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderrandom_repositorysetup_managingteam_892197FD" {
      ~ etag       = "W/\"0a605ee389bdb3cce26b2a32ca89a493fff7f8d41481cc5f8f3c3c8b926fc945\"" -> "W/\"d1a0874f9459a54a4fdd7176b5589461505f262112f0f395e7e1e58bf89992bf\""
        id         = "6602018:cdktf-provider-random"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderdockergo_repositorysetup_managingteam_58AEF965 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderdockergo_repositorysetup_managingteam_58AEF965" {
      ~ etag       = "W/\"eda73fbeb5df83ac6abc433a9ee2958272a0f55c636857e0a34c2b758d34e4fe\"" -> "W/\"de5ba1859d743ee8c94a719e41799f1f747e8439d1d2fdf5797bb87500a1f8a0\""
        id         = "6602018:cdktf-provider-docker-go"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidergithubgo_repositorysetup_managingteam_2896D63F has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidergithubgo_repositorysetup_managingteam_2896D63F" {
      ~ etag       = "W/\"3e8e84037d753a12918f507d9c744e107c0574a71377599c10790b788b762060\"" -> "W/\"c2b7fe800f5043a5e268c735f5da56daa8c094dcbf6b59c4be4f542b34075a02\""
        id         = "6602018:cdktf-provider-github-go"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderdnsimplego_repositorysetup_managingteam_0FB60159 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderdnsimplego_repositorysetup_managingteam_0FB60159" {
      ~ etag       = "W/\"32bb8645b211cdb817798927df94dbb74cc2e2b14a7d72a5478429fea40cd687\"" -> "W/\"4d376ecd2d57fc0ea9a070e56a5cb50faa01acc0c632b9813181f214c8ff2b92\""
        id         = "6602018:cdktf-provider-dnsimple-go"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfproviderpagerduty_repo_0AF36FE3 has been changed
  ~ resource "github_repository" "repos_cdktfproviderpagerduty_repo_0AF36FE3" {
      ~ etag                   = "W/\"22c088fb8c5db951a8335c9888670ae93805c104940df3c5493e59d4c3dab02a\"" -> "W/\"4cd1994407e840f6e67780acd74547293d7e3ae0baa6619b51ffa06173545b76\""
        id                     = "cdktf-provider-pagerduty"
        name                   = "cdktf-provider-pagerduty"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderdatabricks_repositorysetup_managingteam_8D34FFE1 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderdatabricks_repositorysetup_managingteam_8D34FFE1" {
      ~ etag       = "W/\"9d58e839fdab063841f229185cf0e118067e7b144e7d0dfab2a6ae71cec306eb\"" -> "W/\"b09d26763d3e5b7f711e92b8da99edf5714297c8192debc6f35f0e95f0224c9a\""
        id         = "6602018:cdktf-provider-databricks"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfprovideropentelekomcloud_repo_8ABA825B has been changed
  ~ resource "github_repository" "repos_cdktfprovideropentelekomcloud_repo_8ABA825B" {
      ~ etag                   = "W/\"3f72e04ce85d5b4869851277ed1ca43d7d16ec1f695571c30d2b65018d8aafa0\"" -> "W/\"01b40cf78eebd1da63e6a7b58ab71f175bc02becaf2ffab6a349bb018840d4fc\""
        id                     = "cdktf-provider-opentelekomcloud"
        name                   = "cdktf-provider-opentelekomcloud"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderdigitalocean_repositorysetup_managingteam_751C9ACD has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderdigitalocean_repositorysetup_managingteam_751C9ACD" {
      ~ etag       = "W/\"97e3d586cf7d9b1f46eb450ac0adb2277cd978d61d015e0b91457a983f103f0b\"" -> "W/\"f99134e7634a21c3d66de4d5711a60b99da144df8bfe5b66628384dbeb7c4d21\""
        id         = "6602018:cdktf-provider-digitalocean"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderhashicups_repositorysetup_managingteam_6073CDD4 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderhashicups_repositorysetup_managingteam_6073CDD4" {
      ~ etag       = "W/\"bb6ecbda9f5d02fcd3c0fa23e5256db88b6de69e7741e5adcae41711048fff82\"" -> "W/\"d13deb21f8c6bd62291e2de6e20445065f264c2a9a6a573afe2c704c7203129d\""
        id         = "6602018:cdktf-provider-hashicups"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidertlsgo_repositorysetup_managingteam_E1E51A55 has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidertlsgo_repositorysetup_managingteam_E1E51A55" {
      ~ etag       = "W/\"deb664eda20ff57883e0112c911e464b06d7e55b807afe71e6538a070cac1771\"" -> "W/\"b6dfdc124d7fe9aa9964f73749f8d0913b0d9bac058c498e8e85134c6f87f535\""
        id         = "6602018:cdktf-provider-tls-go"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderdocker_repositorysetup_managingteam_39B293A8 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderdocker_repositorysetup_managingteam_39B293A8" {
      ~ etag       = "W/\"80b8e12f64eb00e90730be6ea2180c090c292412aca5294b2a383b5e6b0683fa\"" -> "W/\"efddd4e7bc42ec0f0831eb56493416b7bcd7e0748385559ae4e906fad95796cd\""
        id         = "6602018:cdktf-provider-docker"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidercloudflarego_repositorysetup_managingteam_D3449EB2 has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidercloudflarego_repositorysetup_managingteam_D3449EB2" {
      ~ etag       = "W/\"a19541e33eb01d5b37e7d336de486647c0eaabc2e848c573146828472b51c078\"" -> "W/\"627b6c2175c7c13f38a5f41141749173689022d40ef6c0c4ab05faafea5da4bf\""
        id         = "6602018:cdktf-provider-cloudflare-go"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidergooglebetago_repositorysetup_managingteam_D83EF40E has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidergooglebetago_repositorysetup_managingteam_D83EF40E" {
      ~ etag       = "W/\"4767fe3488b263ef24243e6e0a33429c41496dfbe669a83d2565c7d8747d3d70\"" -> "W/\"8d3f2c3bf5d5df53543156fe49bf82f2fd786afc3ff874992a8e89fbd5b43172\""
        id         = "6602018:cdktf-provider-googlebeta-go"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderpostgresqlgo_repositorysetup_managingteam_CD45B76A has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderpostgresqlgo_repositorysetup_managingteam_CD45B76A" {
      ~ etag       = "W/\"36ff8701145f93c8fc119d6691a6aa3d2980ba81e22bf9cd32d0f51ce50f1855\"" -> "W/\"cf96e9bb96689dc442214ddbf67135e7458ffaaa44158b1d7843dcb305b925d8\""
        id         = "6602018:cdktf-provider-postgresql-go"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderarchive_repositorysetup_managingteam_773585EF has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderarchive_repositorysetup_managingteam_773585EF" {
      ~ etag       = "W/\"cd353cb2df31e0e89b37d9455ddf04b50a74680c1f96c8e3ce46992299b29278\"" -> "W/\"44b3c8c9b3bedb2b1747b6256163427bc608fe50b4f9dd2c35e67af05986a5aa\""
        id         = "6602018:cdktf-provider-archive"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderhelmgo_repositorysetup_managingteam_48415CDF has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderhelmgo_repositorysetup_managingteam_48415CDF" {
      ~ etag       = "W/\"d0da9442f4e01a8bf5d6449eaa03cc036511cb741748af963bd26121e525a9c2\"" -> "W/\"b9b4c62c4c4fd7d09d8165570b2304efd1e943bb2f880e659326efa662655154\""
        id         = "6602018:cdktf-provider-helm-go"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovideropentelekomcloudgo_repositorysetup_managingteam_CA4F75C1 has been changed
  ~ resource "github_team_repository" "repos_cdktfprovideropentelekomcloudgo_repositorysetup_managingteam_CA4F75C1" {
      ~ etag       = "W/\"2fe2840be37c6405cfaca8652b2473fd4272dec3e31742d5236121f19d74f6c6\"" -> "W/\"cf560e8719bee3df4ca03d26a2ad6d65c26bd62a5fd42ebae872cc462e755c9d\""
        id         = "6602018:cdktf-provider-opentelekomcloud-go"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderarchivego_repositorysetup_managingteam_AFD84370 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderarchivego_repositorysetup_managingteam_AFD84370" {
      ~ etag       = "W/\"73b4d207b3fe299dfba4d1294471ae8261f826f61451863a32f831fd187997b7\"" -> "W/\"d8dbf3dc0ab96622bf92a2ef19a04efb26e70a3267a72914107d82beb4e9bfe7\""
        id         = "6602018:cdktf-provider-archive-go"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovideraws_repositorysetup_managingteam_AFE63812 has been changed
  ~ resource "github_team_repository" "repos_cdktfprovideraws_repositorysetup_managingteam_AFE63812" {
      ~ etag       = "W/\"2464ea95259e57388bdea60d1b996288f7e4dc2249751cb92d1e2dd6eb418d8e\"" -> "W/\"2e342584651201ea34bfbe373273651e347681039b17ffa882ba31942fc4e730\""
        id         = "6602018:cdktf-provider-aws"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidergooglego_repositorysetup_managingteam_20D524CA has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidergooglego_repositorysetup_managingteam_20D524CA" {
      ~ etag       = "W/\"184d4cf835c64dd1559ad515bd5e48ea0be0f605bfdeac371582d83aee73f4ca\"" -> "W/\"d26390f8e8014d19dcba6528ace35de07a79891d6a6f796c1e1a0def1b5a902e\""
        id         = "6602018:cdktf-provider-google-go"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfprovidergooglebeta_repo_077561F9 has been changed
  ~ resource "github_repository" "repos_cdktfprovidergooglebeta_repo_077561F9" {
      ~ etag                   = "W/\"8e13159b213ac9baf445ed886569d3962f07a20255e0dc5f54559a83dacd3c94\"" -> "W/\"b49fadd3d86a8c918987c92920b7007c0a4611463dced5d74c9793be9ee8b157\""
        id                     = "cdktf-provider-googlebeta"
        name                   = "cdktf-provider-googlebeta"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderlocalgo_repositorysetup_managingteam_64F46EA1 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderlocalgo_repositorysetup_managingteam_64F46EA1" {
      ~ etag       = "W/\"3b6d22cb79699ced6ce82d97098a47299f38f71be25741a7e808511a1f9fe50d\"" -> "W/\"26ff050dedd68bb0d989498cda06c67b4300a31a197d6ca50e324c9288b14788\""
        id         = "6602018:cdktf-provider-local-go"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderazureadgo_repositorysetup_managingteam_05337DF5 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderazureadgo_repositorysetup_managingteam_05337DF5" {
      ~ etag       = "W/\"851d8b08d2e789b361cc2693bc2e76ab2f48a71bcd7fdb1a35edec5de9476315\"" -> "W/\"7a430ff356fdaa35ada51a8d022ff882823dc1277048ed5fca7ebf828c49ea9d\""
        id         = "6602018:cdktf-provider-azuread-go"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovideracme_repositorysetup_managingteam_B2C685CA has been changed
  ~ resource "github_team_repository" "repos_cdktfprovideracme_repositorysetup_managingteam_B2C685CA" {
      ~ etag       = "W/\"32acf4954fe69a1e9a3d8b64e30fa9c6919fb1da25972312d48e7517b4675075\"" -> "W/\"c18db6d707d63948d157b3cd54938e01111b8f2e6e46c62a2232d6f56bf5f1a2\""
        id         = "6602018:cdktf-provider-acme"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfproviderazurerm_repo_19E06DC3 has been changed
  ~ resource "github_repository" "repos_cdktfproviderazurerm_repo_19E06DC3" {
      ~ etag                   = "W/\"817515b694e97dfbf2be58a358ff65ea3288eb69312e1b522ae2eb8f4112cf7e\"" -> "W/\"9ccc2011d4409567958caad9ffd630a46242d2604067c27fe7d98500ae43fd71\""
        id                     = "cdktf-provider-azurerm"
        name                   = "cdktf-provider-azurerm"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderionoscloudgo_repositorysetup_managingteam_4D65753C has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderionoscloudgo_repositorysetup_managingteam_4D65753C" {
      ~ etag       = "W/\"4da445c32c0a92d0b7e2629298aae1e3cd8d75428d1731288095c82076819ddb\"" -> "W/\"fefc6157eb169b22fcfea12bc57b1bb14d00cb75f4f34d98110e62fbdd3a055b\""
        id         = "6602018:cdktf-provider-ionoscloud-go"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidertime_repositorysetup_managingteam_5EEA5287 has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidertime_repositorysetup_managingteam_5EEA5287" {
      ~ etag       = "W/\"86684558603916fe58f05e2191c3517e579ecc4d72f6e3bc8daf850a81acf584\"" -> "W/\"39a4dac344d833761eed8235898f3ad1204ee90caa9df2c25e80ec75adb63fa3\""
        id         = "6602018:cdktf-provider-time"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidercloudflare_repositorysetup_managingteam_B6B6C03C has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidercloudflare_repositorysetup_managingteam_B6B6C03C" {
      ~ etag       = "W/\"93f0c07b1f57ae3f8f83bb125768e1cf84af473e3f7cf9061e3ea799ef0b06e4\"" -> "W/\"7e25fc0f9d297bd657ae8cc18f1b4702426b027157ef44a5075261a12eda0d9a\""
        id         = "6602018:cdktf-provider-cloudflare"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidernullgo_repositorysetup_managingteam_0D5AEAB7 has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidernullgo_repositorysetup_managingteam_0D5AEAB7" {
      ~ etag       = "W/\"364476c65f51ef1ccfc77f13bc14dcdfeb3aa82b390554a88d8d68d44be537e7\"" -> "W/\"5ff68f363b93b1531d30677a7c30f9574743b78a5d16c5feb4f34cf7835f9fed\""
        id         = "6602018:cdktf-provider-null-go"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidernull_repositorysetup_managingteam_CD112A1D has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidernull_repositorysetup_managingteam_CD112A1D" {
      ~ etag       = "W/\"873824947d33d034ab491bc7e2d8aa3593a8feb665946a9611811bf1ef2c4e7b\"" -> "W/\"df702d80589bdc9c059b501bdca611d9ea88728a0b6746b6502a7f3ad0ce8af9\""
        id         = "6602018:cdktf-provider-null"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidertemplatego_repositorysetup_managingteam_81D4ACA9 has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidertemplatego_repositorysetup_managingteam_81D4ACA9" {
      ~ etag       = "W/\"51f414617dd10dc767cf329f8ed0fd55b68d9f706017c892eef72e0e4b5d6af2\"" -> "W/\"6923efbc22efa05d46a773523c134fa24198a8e8b3baec699b3c4829fc39d395\""
        id         = "6602018:cdktf-provider-template-go"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfprovidersnowflake_repo_483928D8 has been changed
  ~ resource "github_repository" "repos_cdktfprovidersnowflake_repo_483928D8" {
      ~ etag                   = "W/\"8cd56e5b463ac99fe0f8274552d432483369a394a4b9624582710872acd02a94\"" -> "W/\"ba7544208ac9826f7fafc590aa7092c79aac3ed82cacab2e637fa6abcff74947\""
        id                     = "cdktf-provider-snowflake"
        name                   = "cdktf-provider-snowflake"
        # (26 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfprovidernewrelic_repo_D84B1F73 has been changed
  ~ resource "github_repository" "repos_cdktfprovidernewrelic_repo_D84B1F73" {
      ~ etag                   = "W/\"fb1aef8c329a9561f450dbaebf5f8c132471ed93b74e7cc033407b1a4de78be7\"" -> "W/\"f61fc552ab5d9f12b28f916faaf72bcc14ac5363816171e6b9fc432fce70e70f\""
        id                     = "cdktf-provider-newrelic"
        name                   = "cdktf-provider-newrelic"
        # (26 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfprovidergooglebetago_repo_2FB8C0AA has been changed
  ~ resource "github_repository" "repos_cdktfprovidergooglebetago_repo_2FB8C0AA" {
      ~ etag                   = "W/\"13936030d7ca2a889bb1bc6ce7a37e878b7407c6001d5eee762a5982e5e708e5\"" -> "W/\"5f9ac9b5894b0884eaec39aeae9e0d2d5fff328a2a3bf86bb92eea28e2e9ac77\""
        id                     = "cdktf-provider-googlebeta-go"
        name                   = "cdktf-provider-googlebeta-go"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderazuread_repositorysetup_managingteam_6FD24BF4 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderazuread_repositorysetup_managingteam_6FD24BF4" {
      ~ etag       = "W/\"b28af7f5251b377145cd4e385e163ebaa8211fc5158ddae1505ed95ba29e2f92\"" -> "W/\"64eb74297316732a3dc764042f3e0e8733501524738702c52b8a0ecfe92dbffd\""
        id         = "6602018:cdktf-provider-azuread"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfprovideracme_repo_DD1AA41F has been changed
  ~ resource "github_repository" "repos_cdktfprovideracme_repo_DD1AA41F" {
      ~ etag                   = "W/\"65c16b3ee9efd7bddc04eee4f06897bfa5fc5e5a9bae4dbedbe5d2b4cfea8eab\"" -> "W/\"d447716668db0d735f5635ddc01c9d3b409e98432ee3a75284f0f6657bbfcc75\""
        id                     = "cdktf-provider-acme"
        name                   = "cdktf-provider-acme"
        # (26 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfproviderdigitalocean_repo_5200BE67 has been changed
  ~ resource "github_repository" "repos_cdktfproviderdigitalocean_repo_5200BE67" {
      ~ etag                   = "W/\"6b0d87a862c182b3abb50804d721485ee3e02db3472486dc782e2190d1ec783e\"" -> "W/\"f1e2e4013381438f9f952fa67f63fef1acf676e47436ae830d33a8dad02dd31a\""
        id                     = "cdktf-provider-digitalocean"
        name                   = "cdktf-provider-digitalocean"
        # (26 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfproviderdocker_repo_45A47809 has been changed
  ~ resource "github_repository" "repos_cdktfproviderdocker_repo_45A47809" {
      ~ etag                   = "W/\"83dd45ad91f21f54fe2356ec896365751ca588be02850b3a879d963d3bd0a11d\"" -> "W/\"87f5049878fe4741d362e3e82142a2fde0def57394b3915b122a13f873be1fc0\""
        id                     = "cdktf-provider-docker"
        name                   = "cdktf-provider-docker"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderexternalgo_repositorysetup_managingteam_3A0C956B has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderexternalgo_repositorysetup_managingteam_3A0C956B" {
      ~ etag       = "W/\"54bbd3a3499dea6168d64dcdcae17c7140d3f9f4b1d3a709304fd1c6e2c66c2e\"" -> "W/\"1052c93470f049fb5fc8de947a980c5dcacd385a308f1f3d9a85cbfa603af8b4\""
        id         = "6602018:cdktf-provider-external-go"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfprovidercloudflare_repo_69763868 has been changed
  ~ resource "github_repository" "repos_cdktfprovidercloudflare_repo_69763868" {
      ~ etag                   = "W/\"7c669a4c994f7f0a53226a67ef06c2def13444ceb83106bec9ff322fbd1e3f7d\"" -> "W/\"9687773cbfcd36d41c55b2b54a94341c7b7494ec1aa7bddb97c63439940337c8\""
        id                     = "cdktf-provider-cloudflare"
        name                   = "cdktf-provider-cloudflare"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidercloudinitgo_repositorysetup_managingteam_20D4940D has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidercloudinitgo_repositorysetup_managingteam_20D4940D" {
      ~ etag       = "W/\"1a4cc3b1cca42b3b4539ad54e0ff6f4d76b58bb085305801f4abe61c6fc6c57f\"" -> "W/\"0f8be00810fb6c675a5f5ea1f0831c2b793fc8ab721451e88e328182f075499c\""
        id         = "6602018:cdktf-provider-cloudinit-go"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidertfe_repositorysetup_managingteam_33D41BAB has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidertfe_repositorysetup_managingteam_33D41BAB" {
      ~ etag       = "W/\"3beb2a668e1a9e08ae993b78557e773fdcf7f89beae26324867d23d7fa54ab2e\"" -> "W/\"a5663855d57e95c21abdd3283b64bc45e29f7c062759ba0be5a0c5bc87babc4b\""
        id         = "6602018:cdktf-provider-tfe"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderlocal_repositorysetup_managingteam_9E9A7979 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderlocal_repositorysetup_managingteam_9E9A7979" {
      ~ etag       = "W/\"5d342172c2b486155e5ec14342752095a215169a781b8d1c6074c3797a175455\"" -> "W/\"4b83a2bf4691c25f9f30a692282192dddfd2c399957eebdfb2d5a44d4da63bc7\""
        id         = "6602018:cdktf-provider-local"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidergooglebeta_repositorysetup_managingteam_B8CAECA5 has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidergooglebeta_repositorysetup_managingteam_B8CAECA5" {
      ~ etag       = "W/\"90cd118f7c1959c304c41ad23d6977d4537930e502e3d9678a424e4cc7e87952\"" -> "W/\"227f9c985721c4ed61905e7bb50252206e75624e5b0acaceeefee1125374f9e7\""
        id         = "6602018:cdktf-provider-googlebeta"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfprovidernull_repo_8A692B1D has been changed
  ~ resource "github_repository" "repos_cdktfprovidernull_repo_8A692B1D" {
      ~ etag                   = "W/\"52114956f559e70479867fb7ee32533a063077bcda328dd13991a122a95d5bec\"" -> "W/\"738d78debabd7ebbae5455acc74594e294d2745c973ded82cb89a5149aced2af\""
        id                     = "cdktf-provider-null"
        name                   = "cdktf-provider-null"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidergitlab_repositorysetup_managingteam_31742640 has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidergitlab_repositorysetup_managingteam_31742640" {
      ~ etag       = "W/\"b868359ff0e5a5999f3fdf8c3515ef8eb674dbcbc4f1d27b41d724da3bcd564a\"" -> "W/\"aacb90ffd99f2ced1b66fa6e2c9c98774a000de047b0be0d4a6d37b947023872\""
        id         = "6602018:cdktf-provider-gitlab"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfprovidercloudinit_repo_4E4D12FF has been changed
  ~ resource "github_repository" "repos_cdktfprovidercloudinit_repo_4E4D12FF" {
      ~ etag                   = "W/\"19627d7d163076434bd7cc7db8d0a842fa27953e51b8877a9a6afd37a3dec5bb\"" -> "W/\"838e2d36fa31255d8b95be0e7db31d6c472c3fbd56471a4d2568e880b8163fb9\""
        id                     = "cdktf-provider-cloudinit"
        name                   = "cdktf-provider-cloudinit"
        # (26 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfprovidertime_repo_35EDF4BB has been changed
  ~ resource "github_repository" "repos_cdktfprovidertime_repo_35EDF4BB" {
      ~ etag                   = "W/\"fb8cc381c6773d9130dbd8f46e5fdef0f216fcde561e33015b8a8d3284aaeacd\"" -> "W/\"d2e2976ae13e11806174e86fe4d82eb7f71989cc5492f105708881146e0475c0\""
        id                     = "cdktf-provider-time"
        name                   = "cdktf-provider-time"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidervaultgo_repositorysetup_managingteam_3D03CE6E has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidervaultgo_repositorysetup_managingteam_3D03CE6E" {
      ~ etag       = "W/\"36b0593a404d5d67ffae9f07f9da3db7e24b8cd00a27cdddb8c81eebac9bf40a\"" -> "W/\"1b2682ac34463fed3765dc04c2dc72168082cec31d95dd764c087630d373dcf7\""
        id         = "6602018:cdktf-provider-vault-go"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderdatabricksgo_repositorysetup_managingteam_C12D2F50 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderdatabricksgo_repositorysetup_managingteam_C12D2F50" {
      ~ etag       = "W/\"d5dee45e863699630b56117ee5f9b43f989707dd2a3015259ca3fc5d369cf029\"" -> "W/\"85dca32428dd708e88f296e2345ac45d91f48af00290aab246baee508a9c617d\""
        id         = "6602018:cdktf-provider-databricks-go"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderproject_repositorysetup_managingteam_DFA62268 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderproject_repositorysetup_managingteam_DFA62268" {
      ~ etag       = "W/\"73e9bfc5a294617b09ac5316724143a2539fa9ee946d3d43418236f4f4b7f344\"" -> "W/\"e395cea21ef7189566427ac50b19535683dc8aaead3dff875fbcf1bebd208abc\""
        id         = "6602018:cdktf-provider-project"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderdigitaloceango_repositorysetup_managingteam_B082C767 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderdigitaloceango_repositorysetup_managingteam_B082C767" {
      ~ etag       = "W/\"67fb6bc28da2b3dd90db8cebeb941f99705085f86aae7794b52d4aa6d0390da3\"" -> "W/\"e8b496628a4c947e9d37034dbdc143d09ce7748d71f78ec6fd3592d41a40ca8f\""
        id         = "6602018:cdktf-provider-digitalocean-go"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfprovideraws_repo_55F46B23 has been changed
  ~ resource "github_repository" "repos_cdktfprovideraws_repo_55F46B23" {
      ~ etag                   = "W/\"49dcb1118d7c94a1521cf1a045b55b1cd3b11328e5777bdee130e80832661cff\"" -> "W/\"9d6ffa7dc6884d22f1377e02f51f8baa2a000b9a11a3d5a58633aaaa2f7e21c9\""
        id                     = "cdktf-provider-aws"
        name                   = "cdktf-provider-aws"
        # (26 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfprovideropentelekomcloudgo_repo_38661664 has been changed
  ~ resource "github_repository" "repos_cdktfprovideropentelekomcloudgo_repo_38661664" {
      ~ etag                   = "W/\"48359305b1f972c4ba8a7516c0749fad9a7800bab36e5e58485192438042f051\"" -> "W/\"f9f492c3279bf84774c39d755192debe227c1d8b886e17bbb1abb5152f0ddb60\""
        id                     = "cdktf-provider-opentelekomcloud-go"
        name                   = "cdktf-provider-opentelekomcloud-go"
        # (26 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfproviderkubernetes_repo_D69C3A79 has been changed
  ~ resource "github_repository" "repos_cdktfproviderkubernetes_repo_D69C3A79" {
      ~ etag                   = "W/\"6dcc470d16185baf078153ac2d8a0c89af3962878cf0af1ada1e2e3061874e3b\"" -> "W/\"73c21cb737eb6ae679114db5f1c8c0eb773901dcd8690b2083c1546dcb6622f9\""
        id                     = "cdktf-provider-kubernetes"
        name                   = "cdktf-provider-kubernetes"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderkubernetesgo_repositorysetup_managingteam_F07D5F4D has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderkubernetesgo_repositorysetup_managingteam_F07D5F4D" {
      ~ etag       = "W/\"99b9a5c2c104f48f4448f6ff3d928961c78a6193364a13a2d5c026d0f78134a3\"" -> "W/\"296a13b9fc60e8565dc06efad29c8f7165c9de23bd803d0ad71b38c21d84f4cc\""
        id         = "6602018:cdktf-provider-kubernetes-go"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfprovidertemplate_repo_08DFB684 has been changed
  ~ resource "github_repository" "repos_cdktfprovidertemplate_repo_08DFB684" {
      ~ etag                   = "W/\"751416d8da59b5f8d1af3019cd67269e831e15a36295f8fff2fd83a2a5ff98c6\"" -> "W/\"1f4894c5bb50357d08c1ccf481e997951e210b061b7a710df118f267177752b2\""
        id                     = "cdktf-provider-template"
        name                   = "cdktf-provider-template"
        # (26 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfproviderrandom_repo_448077DE has been changed
  ~ resource "github_repository" "repos_cdktfproviderrandom_repo_448077DE" {
      ~ etag                   = "W/\"a701f5a009c2847f1fbd0541fdc8a1f2f400b88baa355a7391d42ff3cd0267d0\"" -> "W/\"2eeaf8a40c218a0e109880c3fd381ae8f15d2d55ecf2a75e34ef0183228b809d\""
        id                     = "cdktf-provider-random"
        name                   = "cdktf-provider-random"
        # (26 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfproviderhelm_repo_E5C9B6C8 has been changed
  ~ resource "github_repository" "repos_cdktfproviderhelm_repo_E5C9B6C8" {
      ~ etag                   = "W/\"d577c346710f2b00d2833d2e32837e72bc997a846efa83df6828d79a36217c05\"" -> "W/\"5d7ce66fc71a5ff9b15e9ccadd4847fcb08033356413bd66ace076b2c354be48\""
        id                     = "cdktf-provider-helm"
        name                   = "cdktf-provider-helm"
        # (26 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfproviderspotinst_repo_AC5A9A96 has been changed
  ~ resource "github_repository" "repos_cdktfproviderspotinst_repo_AC5A9A96" {
      ~ etag                   = "W/\"3a950367e9dfe845830771c56ebae32fb42f807f4a291b8b7bd157d6229a9e5c\"" -> "W/\"eafb7fbbae4ff6f4f140b0eda1e9ce1be91cf1871006d088b4e8ed29977c4991\""
        id                     = "cdktf-provider-spotinst"
        name                   = "cdktf-provider-spotinst"
        # (26 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfproviderupcloud_repo_D37E7624 has been changed
  ~ resource "github_repository" "repos_cdktfproviderupcloud_repo_D37E7624" {
      ~ etag                   = "W/\"ed7b51dbcfe3703562193bb061bf3dc74e5874c6072a118b2a6a2584c0128940\"" -> "W/\"dfa3f44708364b44ad44a36ff71c2d41d85b815b936a14b0deea0561666dda6a\""
        id                     = "cdktf-provider-upcloud"
        name                   = "cdktf-provider-upcloud"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidergitlabgo_repositorysetup_managingteam_3DD27EA8 has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidergitlabgo_repositorysetup_managingteam_3DD27EA8" {
      ~ etag       = "W/\"713322d83ab47efb05cc4bbd05516b1167ade5a4a28d1ce0c4bed7f2b677ce73\"" -> "W/\"f7e64a8e40cfa9d44bebcdfff6591faba0f7577d24c578a8d8bcfc1a15d51b83\""
        id         = "6602018:cdktf-provider-gitlab-go"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfproviderpostgresql_repo_9CD37AD7 has been changed
  ~ resource "github_repository" "repos_cdktfproviderpostgresql_repo_9CD37AD7" {
      ~ etag                   = "W/\"c1a3ff63de578653c20056c25531e69565e8ff0601691e276c63b7bde4ae065e\"" -> "W/\"fbd5b3fee974f58f1563c3215bf02030ee2729a31d22c273cacb4fb94fcea796\""
        id                     = "cdktf-provider-postgresql"
        name                   = "cdktf-provider-postgresql"
        # (26 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfproviderokta_repo_BB6AE56D has been changed
  ~ resource "github_repository" "repos_cdktfproviderokta_repo_BB6AE56D" {
      ~ etag                   = "W/\"7f8e3cf2f5fb0fa0f3dd22e34222bd383bb15e8c4061cc95c74722835ef5d776\"" -> "W/\"a6c663cb0957cc65579e6089fd23442bcd1b99c922490f55f7c70e409437f710\""
        id                     = "cdktf-provider-okta"
        name                   = "cdktf-provider-okta"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfrepositorymanager_repositorysetup_managingteam_1EC6BF14 has been changed
  ~ resource "github_team_repository" "repos_cdktfrepositorymanager_repositorysetup_managingteam_1EC6BF14" {
      ~ etag       = "W/\"7f11fcbb1844293dd225d65b0600f5e12a4aa5beae0f92491c4328a38ce74a7a\"" -> "W/\"589f084cef4ce06285693d1d370d7dabad7b69426d0a3254e91d2ad8446c94dc\""
        id         = "6602018:cdktf-repository-manager"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderdatadog_repositorysetup_managingteam_29E8E525 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderdatadog_repositorysetup_managingteam_29E8E525" {
      ~ etag       = "W/\"095688e325cee40cd6a77364eebe1dd760c5ec7385437259bda3566024e0c0f5\"" -> "W/\"0a71c2ca2212cb5aaa517fc2bca11e579aacda1ded2091f8eda357006b5641ca\""
        id         = "6602018:cdktf-provider-datadog"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderspotinstgo_repositorysetup_managingteam_8753A903 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderspotinstgo_repositorysetup_managingteam_8753A903" {
      ~ etag       = "W/\"78a962b0cc02fdce7a0dc8b9df86f893a993ca7f096492659dc514f059c6391b\"" -> "W/\"498c3d10951ab5ef908f9ebb0294ffda06a955ed7e84aa24017f383f01cbeda7\""
        id         = "6602018:cdktf-provider-spotinst-go"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidercloudinit_repositorysetup_managingteam_DFBE2D6C has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidercloudinit_repositorysetup_managingteam_DFBE2D6C" {
      ~ etag       = "W/\"a7a46e772216b4289f4d0ce323cede92ae483c1a4924bdc67c18ffb7b8306fad\"" -> "W/\"7a5e83eb502002a16cd2649a7031250915110c1ae97b18143be0dc8061c89c1b\""
        id         = "6602018:cdktf-provider-cloudinit"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidertimego_repositorysetup_managingteam_87D8A9B2 has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidertimego_repositorysetup_managingteam_87D8A9B2" {
      ~ etag       = "W/\"0fe24b89e566ea8890b2deb59455a167423eb43e85b76bf0d4bb8f917f985baa\"" -> "W/\"1d21d60f51f41b24c553325483a3a6c2c83d0e0ea78ff81a843e0d8882c3a034\""
        id         = "6602018:cdktf-provider-time-go"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidersnowflake_repositorysetup_managingteam_3B7100C9 has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidersnowflake_repositorysetup_managingteam_3B7100C9" {
      ~ etag       = "W/\"42f5e606a9d5eb2bcf9085f94625ec9e661b1fcb20e89574a617d5a5d3989b6c\"" -> "W/\"48ade162732dedba3207809211f8894ffa4e6b1efeb331450c13399ee8570212\""
        id         = "6602018:cdktf-provider-snowflake"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderdatadoggo_repositorysetup_managingteam_926F7CC5 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderdatadoggo_repositorysetup_managingteam_926F7CC5" {
      ~ etag       = "W/\"f744eeced86f7bb5b055745a71a9ade453635a69ce4b40660fdf6b9825ee8325\"" -> "W/\"967c70c6b45216dca372d74d2f15455741194c9734ee47ea8c692c1c78eeebc7\""
        id         = "6602018:cdktf-provider-datadog-go"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidernewrelic_repositorysetup_managingteam_EBE22D1D has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidernewrelic_repositorysetup_managingteam_EBE22D1D" {
      ~ etag       = "W/\"33a5f843ac71f7506581096718d8a9db9bb7ee34dcecdf8f70bba9597b428809\"" -> "W/\"8469eeace080af923af8ae61b8316ee0da7e2698d79adcc703c150669bf52c1a\""
        id         = "6602018:cdktf-provider-newrelic"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderpagerduty_repositorysetup_managingteam_BBF13F0C has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderpagerduty_repositorysetup_managingteam_BBF13F0C" {
      ~ etag       = "W/\"faeaf66da90119baa2d2314991db6e5d2d3ac66874c2104abc19f1b284074db1\"" -> "W/\"fe6b98925f3612f2afabf06665b4a82a4e4472818d42fbb5d6519d08edcad4f6\""
        id         = "6602018:cdktf-provider-pagerduty"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderupcloudgo_repositorysetup_managingteam_D8F8114B has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderupcloudgo_repositorysetup_managingteam_D8F8114B" {
      ~ etag       = "W/\"960374669e5a682186eeae221fdab05b212fe99a6b61b69c72d447688ae43c39\"" -> "W/\"f5edf4fb42a785fd1d784521798a74d00dfad5042a891d0e0d5b6d0b42678de1\""
        id         = "6602018:cdktf-provider-upcloud-go"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfprovidertfe_repo_27B3A80F has been changed
  ~ resource "github_repository" "repos_cdktfprovidertfe_repo_27B3A80F" {
      ~ etag                   = "W/\"ee26223d54a127d47f8f0fe1dfecf7b591d30d2a2913c2e2343d3ae87c0a7c3f\"" -> "W/\"77a2d05ff4caa3ec4907662fba05148dbe136d999f39713f5a003f3923dd0f26\""
        id                     = "cdktf-provider-tfe"
        name                   = "cdktf-provider-tfe"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovideropentelekomcloud_repositorysetup_managingteam_E8C53767 has been changed
  ~ resource "github_team_repository" "repos_cdktfprovideropentelekomcloud_repositorysetup_managingteam_E8C53767" {
      ~ etag       = "W/\"849161e16abc2f162c27d7a556c13c2f30d6b8021cc1ccd662e8107464249c1d\"" -> "W/\"57136b35c969e3c4cac0f0e6201ca4d2362380101034c5cbe27cd1e511990fc6\""
        id         = "6602018:cdktf-provider-opentelekomcloud"
        # (3 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_repository_file.repos_cdktfprovideracmego_repositorysetup_codeowners_1473FC63 will be created
  + resource "github_repository_file" "repos_cdktfprovideracmego_repositorysetup_codeowners_1473FC63" {
      + branch              = "main"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = (known after apply)
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            # These owners will be the default owners for everything in 
            # the repo. Unless a later match takes precedence, 
            # they will be requested for review when someone opens a 
            # pull request.
            *       @cdktf/tf-cdk-team
        EOT
      + file                = ".github/CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + repository          = "cdktf-provider-acme-go"
      + sha                 = (known after apply)
    }

  # github_repository_file.repos_cdktfproviderarchivego_repositorysetup_codeowners_0326F9F5 will be created
  + resource "github_repository_file" "repos_cdktfproviderarchivego_repositorysetup_codeowners_0326F9F5" {
      + branch              = "main"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = (known after apply)
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            # These owners will be the default owners for everything in 
            # the repo. Unless a later match takes precedence, 
            # they will be requested for review when someone opens a 
            # pull request.
            *       @cdktf/tf-cdk-team
        EOT
      + file                = ".github/CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + repository          = "cdktf-provider-archive-go"
      + sha                 = (known after apply)
    }

  # github_repository_file.repos_cdktfproviderawsgo_repositorysetup_codeowners_787A0B78 will be created
  + resource "github_repository_file" "repos_cdktfproviderawsgo_repositorysetup_codeowners_787A0B78" {
      + branch              = "main"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = (known after apply)
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            # These owners will be the default owners for everything in 
            # the repo. Unless a later match takes precedence, 
            # they will be requested for review when someone opens a 
            # pull request.
            *       @cdktf/tf-cdk-team
        EOT
      + file                = ".github/CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + repository          = "cdktf-provider-aws-go"
      + sha                 = (known after apply)
    }

  # github_repository_file.repos_cdktfproviderazureadgo_repositorysetup_codeowners_306004A4 will be created
  + resource "github_repository_file" "repos_cdktfproviderazureadgo_repositorysetup_codeowners_306004A4" {
      + branch              = "main"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = (known after apply)
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            # These owners will be the default owners for everything in 
            # the repo. Unless a later match takes precedence, 
            # they will be requested for review when someone opens a 
            # pull request.
            *       @cdktf/tf-cdk-team
        EOT
      + file                = ".github/CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + repository          = "cdktf-provider-azuread-go"
      + sha                 = (known after apply)
    }

  # github_repository_file.repos_cdktfproviderazurermgo_repositorysetup_codeowners_FDC5BBC0 will be created
  + resource "github_repository_file" "repos_cdktfproviderazurermgo_repositorysetup_codeowners_FDC5BBC0" {
      + branch              = "main"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = (known after apply)
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            # These owners will be the default owners for everything in 
            # the repo. Unless a later match takes precedence, 
            # they will be requested for review when someone opens a 
            # pull request.
            *       @cdktf/tf-cdk-team
        EOT
      + file                = ".github/CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + repository          = "cdktf-provider-azurerm-go"
      + sha                 = (known after apply)
    }

  # github_repository_file.repos_cdktfprovidercloudflarego_repositorysetup_codeowners_BE0E92A5 will be created
  + resource "github_repository_file" "repos_cdktfprovidercloudflarego_repositorysetup_codeowners_BE0E92A5" {
      + branch              = "main"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = (known after apply)
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            # These owners will be the default owners for everything in 
            # the repo. Unless a later match takes precedence, 
            # they will be requested for review when someone opens a 
            # pull request.
            *       @cdktf/tf-cdk-team
        EOT
      + file                = ".github/CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + repository          = "cdktf-provider-cloudflare-go"
      + sha                 = (known after apply)
    }

  # github_repository_file.repos_cdktfprovidercloudinitgo_repositorysetup_codeowners_CD24AFBB will be created
  + resource "github_repository_file" "repos_cdktfprovidercloudinitgo_repositorysetup_codeowners_CD24AFBB" {
      + branch              = "main"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = (known after apply)
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            # These owners will be the default owners for everything in 
            # the repo. Unless a later match takes precedence, 
            # they will be requested for review when someone opens a 
            # pull request.
            *       @cdktf/tf-cdk-team
        EOT
      + file                = ".github/CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + repository          = "cdktf-provider-cloudinit-go"
      + sha                 = (known after apply)
    }

  # github_repository_file.repos_cdktfproviderdatabricksgo_repositorysetup_codeowners_DD587791 will be created
  + resource "github_repository_file" "repos_cdktfproviderdatabricksgo_repositorysetup_codeowners_DD587791" {
      + branch              = "main"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = (known after apply)
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            # These owners will be the default owners for everything in 
            # the repo. Unless a later match takes precedence, 
            # they will be requested for review when someone opens a 
            # pull request.
            *       @cdktf/tf-cdk-team
        EOT
      + file                = ".github/CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + repository          = "cdktf-provider-databricks-go"
      + sha                 = (known after apply)
    }

  # github_repository_file.repos_cdktfproviderdatadoggo_repositorysetup_codeowners_F6429DAB will be created
  + resource "github_repository_file" "repos_cdktfproviderdatadoggo_repositorysetup_codeowners_F6429DAB" {
      + branch              = "main"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = (known after apply)
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            # These owners will be the default owners for everything in 
            # the repo. Unless a later match takes precedence, 
            # they will be requested for review when someone opens a 
            # pull request.
            *       @cdktf/tf-cdk-team
        EOT
      + file                = ".github/CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + repository          = "cdktf-provider-datadog-go"
      + sha                 = (known after apply)
    }

  # github_repository_file.repos_cdktfproviderdigitaloceango_repositorysetup_codeowners_7ED0693B will be created
  + resource "github_repository_file" "repos_cdktfproviderdigitaloceango_repositorysetup_codeowners_7ED0693B" {
      + branch              = "main"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = (known after apply)
      + commit_sha          = (known after ap...
```

</details>

*Pusher: @mutahhir, Action: `pull_request`, Working Directory: ``, Workflow: `Plan`*